<?php

return [
    'name' => 'ប្រភេទ',
    'title' => 'ការគ្រប់គ្រងប្រភេទ',
    'subTitle' => 'ការគ្រប់គ្រងអនុប្រភេទ',
    'dropdown' => [
        'subcategory' => 'អនុប្រភេទ',
    ],
    'tab' => [
        'active' => 'សកម្ម',
        'disable' => 'អសកម្ម',
        'trash' => 'ធុងសំរាម',
    ],
    'breadcrumb' => [
        'all' => 'ទាំងអស់',
    ],
    'filter' => [
        'search' => 'ស្វែងរក...',
        'all' => 'ទាំងអស់',
    ],
    'button' => [
        'create' => 'បង្កើតប្រភេទ',
        'create_new' => 'បង្កើតថ្មី',
        'import' => 'នាំចូលប្រភេទ',
        'reload' => 'ផ្ទុកឡើងវិញ',
        'search' => 'ស្វែងរក',
    ],
    'table' => [
        'no' => 'ល.រ',
        'name' => 'ឈ្មោះ',
        'status' => 'ស្ថានភាព',
        'action' => 'សកម្មភាព',
    ],
    'empty' => [
        'title' => 'មិនមានទិន្នន័យ :name ទេ',
        'description' => 'អ្នកអាចបង្កើត :name ថ្មីដោយចុចប៊ូតុងខាងក្រោម។',
    ],
    'form' => [
        'title' => [
            'create' => 'បង្កើតប្រភេទ',
            'update' => 'កែប្រែប្រភេទ',
        ],
        'status' => [
            'label' => 'ស្ថានភាព',
            'active' => 'សកម្ម',
            'disable' => 'អសកម្ម',
        ],
        'button' => [
            'update' => 'កែប្រែ',
            'submit' => 'រក្សាទុក',
            'cancel' => 'បោះបង់',
        ],
        'photo' => [
            'label' => 'រូបភាព',
            'placeholder' => 'ជ្រើសរើសរូបភាព',
        ],
        'name' => [
            'label' => 'ឈ្មោះ',
            'placeholder' => 'បញ្ចូលឈ្មោះ...',
            'en' => [
                'label' => 'ចំណងជើងជាភាសាអង់គ្លេស',
                'placeholder' => 'បញ្ចូលចំណងជើងជាភាសាអង់គ្លេស',
            ],
            'km' => [
                'label' => 'ចំណងជើងជាភាសាខ្មែរ',
                'placeholder' => 'បញ្ចូលចំណងជើងជាភាសាខ្មែរ',
            ],
            'zh' => [
                'label' => 'ចំណងជើងជាភាសាចិន',
                'placeholder' => 'បញ្ចូលចំណងជើងជាភាសាចិន',
            ],
        ],
        'ordering' => [
            'label' => 'លំដាប់',
            'placeholder' => 'បញ្ចូលលំដាប់',
        ],
        'popular_ordering' => [
            'label' => 'លំដាប់ពេញនិយម',
            'placeholder' => 'បញ្ចូលលំដាប់ពេញនិយម',
        ],
        'type' => [
            'label' => 'ប្រភេទ',
            'placeholder' => 'សូមជ្រើសរើសប្រភេទ',
        ],
    ],
    'validation' => [
        'name_required' => 'សូមបញ្ចូលឈ្មោះ',
        'name_max' => 'ឈ្មោះមិនត្រូវលើសពី ៥០ តួអក្សរទេ',
        'status_required' => 'សូមជ្រើសរើសស្ថានភាព',
        'status_max' => 'ស្ថានភាពមិនត្រូវលើសពី ១ តួអក្សរទេ',
        'status_numeric' => 'ទម្រង់ស្ថានភាពមិនត្រឹមត្រូវ',
    ],
    'dialog' => [
        'confirm_delete' => 'តើអ្នកប្រាកដជាចង់លុបប្រភេទនេះមែនទេ?',
        'confirm_action' => 'តើអ្នកប្រាកដជាចង់ :action មែនទេ?',
    ],
];
