<?php

return [
    'name' => 'មុខតំណែង',
    'title' => 'ការគ្រប់គ្រងមុខតំណែង',
    'position_report' => 'របាយការណ៍មុខតំណែង',
    'button' => [
        'create' => 'បង្កើតមុខតំណែង',
    ],
    'form' => [
        'title' => [
            'create' => 'បង្កើតមុខតំណែង',
            'update' => 'កែប្រែមុខតំណែង',
        ],
        'name' => [
            'label' => 'ចំណងជើង',
            'placeholder' => 'បញ្ចូលចំណងជើង...',
        ],
    ],
    'empty' => [
        'title' => 'មិនមានទិន្នន័យមុខតំណែងទេ',
        'description' => 'អ្នកអាចបង្កើតមុខតំណែងថ្មីដោយចុចប៊ូតុងខាងក្រោម។',
    ],
    'validation' => [
        'title_required' => 'សូមបញ្ចូលចំណងជើង',
        'title_max' => 'ចំណងជើងមិនត្រូវលើសពី ៥០ តួអក្សរទេ',
        'status_required' => 'សូមជ្រើសរើសស្ថានភាព',
        'status_max' => 'ស្ថានភាពមិនត្រូវលើសពី ១ តួអក្សរទេ',
        'status_numeric' => 'ទម្រង់ស្ថានភាពមិនត្រឹមត្រូវ',
        'image_required' => 'សូមជ្រើសរើសរូបភាព',
    ],
    'message' => [
        'create_success' => 'បង្កើតមុខតំណែងបានជោគជ័យ។',
        'update_success' => 'កែប្រែមុខតំណែងបានជោគជ័យ។',
        'save_failed' => 'មិនអាចរក្សាទុកមុខតំណែងបានទេ។',
        'disable_success' => 'បិទដំណើរការមុខតំណែងបានជោគជ័យ។',
        'enable_success' => 'បើកដំណើរការមុខតំណែងបានជោគជ័យ។',
        'status_failed' => 'មិនអាចកែប្រែស្ថានភាពមុខតំណែងបានទេ។',
        'restore_success' => 'ស្តារមុខតំណែងឡើងវិញបានជោគជ័យ។',
        'restore_failed' => 'មិនអាចស្តារមុខតំណែងឡើងវិញបានទេ។',
        'delete_success' => 'លុបមុខតំណែងបានជោគជ័យ។',
        'delete_failed' => 'មិនអាចលុបមុខតំណែងបានទេ។',
        'request_failed' => 'សំណើមិនបានជោគជ័យទេ។',
    ],
];
