<?php

return [
    'name' => 'ផលិតផល',
    'name_title' => 'ឈ្មោះ',
    'title' => 'ការគ្រប់គ្រងផលិតផល',
    'cost' => 'តម្លៃដើម',
    'price' => 'តម្លៃលក់',
    'uom' => 'ខ្នាត',
    'category' => 'ប្រភេទ',
    'real_estate_title' => 'ការគ្រប់គ្រងអចលនទ្រព្យ',
    'hotel_title' => 'ការគ្រប់គ្រងសណ្ឋាគារ',
    'product_report' => 'របាយការណ៍ផលិតផល',
    'gallery' => 'វិចិត្រសាលរូបភាព',
    'dropdown' => [
        'child' => 'កូន',
    ],
    'table' => [
        'category' => 'ប្រភេទ',
        'uom' => 'ខ្នាត',
        'cost' => 'តម្លៃដើម',
        'price' => 'តម្លៃលក់',
    ],
    'button' => [
        'create' => 'បង្កើតផលិតផលថ្មី',
        'import' => 'នាំចូលផលិតផល',
    ],
    'empty_gallery' => [
        'title' => 'វិចិត្រសាលទទេ',
        'description' => 'អ្នកអាចបន្ថែមរូបភាពទៅវិចិត្រសាលដោយចុចប៊ូតុងខាងក្រោម។'
    ],
    'export' => [
        'id' => 'ល.រ',
        'name' => 'ឈ្មោះ',
        'cost' => 'តម្លៃដើម',
        'price' => 'តម្លៃលក់',
        'commission' => 'កម្រៃជើងសារ',
        'created_at' => 'កាលបរិច្ឆេទបង្កើត',
    ],
    'validation' => [
        'category_required' => 'សូមជ្រើសរើសប្រភេទផលិតផល',
        'uom_required' => 'សូមជ្រើសរើសខ្នាតផលិតផល',
        'name_required' => 'សូមបញ្ចូលឈ្មោះផលិតផល',
        'name_max' => 'ឈ្មោះផលិតផលមិនត្រូវលើសពី 50 តួអក្សរឡើយ',
        'name_unique' => 'ឈ្មោះផលិតផលនេះមានរួចហើយ',
        'cost_required' => 'សូមបញ្ចូលតម្លៃដើម',
        'price_required' => 'សូមបញ្ចូលតម្លៃលក់',
        'cost_numeric' => 'ទម្រង់តម្លៃដើមមិនត្រឹមត្រូវ',
        'price_numeric' => 'ទម្រង់តម្លៃលក់មិនត្រឹមត្រូវ',
        'status_required' => 'សូមជ្រើសរើសស្ថានភាព',
        'status_max' => 'ស្ថានភាពមិនត្រឹមត្រូវ',
    ],
    'form' => [
        'title' => [
            'create' => 'បង្កើតផលិតផលថ្មី',
            'update' => 'កែប្រែផលិតផល',
            'copy' => 'ចម្លងផលិតផល'
        ],
        'real_estate_title' => [
            'create' => 'បង្កើតអចលនទ្រព្យ',
            'update' => 'កែប្រែអចលនទ្រព្យ',
            'copy' => 'ចម្លងអចលនទ្រព្យ'
        ],
        'hotel_title' => [
            'create' => 'បង្កើតសណ្ឋាគារ',
            'update' => 'កែប្រែសណ្ឋាគារ',
            'copy' => 'ចម្លងសណ្ឋាគារ'
        ],
        'status' => [
            'label' => 'ស្ថានភាព',
            'active' => 'សកម្ម',
            'disable' => 'អសកម្ម',
        ],
        'button' => [
            'update' => 'កែប្រែ',
            'submit' => 'រក្សាទុក',
            'save_new' => 'រក្សាទុក & បង្កើតថ្មី',
            'cancel' => 'បោះបង់',
            'copy' => 'រក្សាទុកការចម្លង'
        ],
        'photo' => [
            'label' => 'រូបភាព',
            'thumbnail' => 'រូបភាពតំណាង',
            'placeholder' => 'ជ្រើសរើសរូបភាព',
        ],
        'name' => [
            'label' => 'ឈ្មោះ',
            'placeholder' => 'បញ្ចូលឈ្មោះផលិតផល...',
            'en' => [
                'label' => 'ឈ្មោះជាភាសាអង់គ្លេស',
                'placeholder' => 'បញ្ចូលឈ្មោះជាភាសាអង់គ្លេស'
            ],
            'km' => [
                'label' => 'ឈ្មោះជាភាសាខ្មែរ',
                'placeholder' => 'បញ្ចូលឈ្មោះជាភាសាខ្មែរ'
            ],
            'zh' => [
                'label' => 'ឈ្មោះជាភាសាចិន',
                'placeholder' => 'បញ្ចូលឈ្មោះជាភាសាចិន'
            ]
        ],
        'cost' => [
            'label' => 'តម្លៃដើម',
            'placeholder' => 'បញ្ចូលតម្លៃដើម...',
        ],
        'price' => [
            'label' => 'តម្លៃលក់',
            'placeholder' => 'បញ្ចូលតម្លៃលក់...',
        ],
        'category' => [
            'label' => 'ប្រភេទ',
            'placeholder' => 'ជ្រើសរើសប្រភេទ',
        ],
        'uom' => [
            'label' => 'ខ្នាត',
            'placeholder' => 'ជ្រើសរើសខ្នាត',
        ],
        'ordering' => [
            'label' => 'លំដាប់',
            'placeholder' => 'បញ្ចូលលំដាប់លំដោយ',
        ],
        'description' => [
            'label' => [
                'en' => 'ការពិពណ៌នាជាភាសាអង់គ្លេស',
                'km' => 'ការពិពណ៌នាជាភាសាខ្មែរ',
                'zh' => 'ការពិពណ៌នាជាភាសាចិន',
            ],
            'placeholder' => [
                'en' => 'បញ្ចូលការពិពណ៌នាជាភាសាអង់គ្លេស',
                'km' => 'បញ្ចូលការពិពណ៌នាជាភាសាខ្មែរ',
                'zh' => 'បញ្ចូលការពិពណ៌នាជាភាសាចិន',
            ],
        ],
        'discount' => [
            'label' => 'បញ្ចុះតម្លៃ',
            'placeholder' => 'បញ្ចូលការបញ្ចុះតម្លៃ',
        ],
        'qty' => [
            'label' => 'បរិមាណ',
            'placeholder' => 'បញ្ចូលបរិមាណ',
        ],
        'point_value' => [
            'label' => 'ពិន្ទុ',
            'placeholder' => 'បញ្ចូលពិន្ទុ',
        ],
        'choose_store' => [
            'label' => 'ជ្រើសរើសហាង',
            'placeholder' => 'ជ្រើសរើសហាងនៅទីនេះ',
        ],
        'type' => [
            'label' => 'ជ្រើសរើសប្រភេទ',
            'placeholder' => 'បញ្ចូលប្រភេទ',
            'data' => [
                [
                    'slug' => 'other-product',
                    'value' => 'ផលិតផលផ្សេងទៀត'
                ],
                [
                    'slug' => 'new-product',
                    'value' => 'ផលិតផលថ្មី'
                ],
                [
                    'slug' => 'best-product',
                    'value' => 'ផលិតផលល្អបំផុត'
                ],
                [
                    'slug' => 'recommend-product',
                    'value' => 'ផលិតផលណែនាំ'
                ],
            ]
        ],
        'allow_call' => [
            'label' => 'អនុញ្ញាតឱ្យហៅទូរស័ព្ទ'
        ],
        'allow_add_cart' => [
            'label' => 'បន្ថែមទៅកន្ត្រក'
        ],
        'brand' => [
            'label' => 'ជ្រើសរើសម៉ាក'
        ],
        'bedroom_number' => [
            'en' => [
                'label' => 'ចំនួនបន្ទប់គេង',
                'placeholder' => 'បញ្ចូលចំនួនបន្ទប់គេង'
            ],
            'km' => [
                'label' => 'ចំនួនបន្ទប់គេង',
                'placeholder' => 'បញ្ចូលចំនួនបន្ទប់គេង'
            ],
            'zh' => [
                'label' => 'ចំនួនបន្ទប់គេង',
                'placeholder' => 'បញ្ចូលចំនួនបន្ទប់គេង'
            ]
        ],
        'bathroom' => [
            'en' => [
                'label' => 'បន្ទប់ទឹក',
                'placeholder' => 'បញ្ចូលបន្ទប់ទឹក'
            ],
            'km' => [
                'label' => 'បន្ទប់ទឹក',
                'placeholder' => 'បញ្ចូលបន្ទប់ទឹក'
            ],
            'zh' => [
                'label' => 'បន្ទប់ទឹក',
                'placeholder' => 'បញ្ចូលបន្ទប់ទឹក'
            ]
        ],
        'face_position' => [
            'en' => [
                'label' => 'ទីតាំងបែរមុខ',
                'placeholder' => 'បញ្ចូលទីតាំងបែរមុខ'
            ],
            'km' => [
                'label' => 'ទីតាំងបែរមុខ',
                'placeholder' => 'បញ្ចូលទីតាំងបែរមុខ'
            ],
            'zh' => [
                'label' => 'ទីតាំងបែរមុខ',
                'placeholder' => 'បញ្ចូលទីតាំងបែរមុខ'
            ]
        ],
        'size' => [
            'en' => [
                'label' => 'ទំហំ',
                'placeholder' => 'បញ្ចូលទំហំ'
            ],
            'km' => [
                'label' => 'ទំហំ',
                'placeholder' => 'បញ្ចូលទំហំ'
            ],
            'zh' => [
                'label' => 'ទំហំ',
                'placeholder' => 'បញ្ចូលទំហំ'
            ]
        ],
        'facing' => [
            'east' => "កើត",
            'north' => "ជើង",
            'northeast' => "ឦសាន",
            'northwest' => "ពាយព្យ",
            'southeast' => "អាគ្នេយ៍",
            'southwest' => "និរតី",
            'west' => "លិច",
        ]
    ],
    'description' => [
        'label' =>
        [
            'en' => 'ការពិពណ៌នាជាភាសាអង់គ្លេស',
            'km' => 'ការពិពណ៌នាជាភាសាខ្មែរ',
            'zh' => 'ការពិពណ៌នាជាភាសាចិន',
        ],
    ],
];
