<?php

return [
    'name' => 'អ្នកផ្គត់ផ្គង់',
    'title' => 'ការគ្រប់គ្រងអ្នកផ្គត់ផ្គង់',

    'tab' => [
        'active' => 'សកម្ម',
        'disable' => 'អសកម្ម',
        'trash' => 'ធុងសំរាម',
    ],
    'breadcrumb' => [
        'all' => 'ទាំងអស់',
    ],
    'filter' => [
        'search' => 'ស្វែងរក...',
        'all' => 'ទាំងអស់',
    ],
    'button' => [
        'create' => 'បង្កើតអ្នកផ្គត់ផ្គង់',
        'create_new' => 'បង្កើតថ្មី',
        'import' => 'នាំចូលអ្នកផ្គត់ផ្គង់',
        'reload' => 'ផ្ទុកឡើងវិញ',
        'search' => 'ស្វែងរក',
    ],
    'table' => [
        'no' => 'ល.រ',
        'name' => 'ឈ្មោះ',
        'ordering' => 'លំដាប់',
        'status' => 'ស្ថានភាព',
        'action' => 'សកម្មភាព',
    ],
    'empty' => [
        'title' => 'មិនមានទិន្នន័យ :name ទេ',
        'description' => 'អ្នកអាចបង្កើត :name ថ្មីដោយចុចប៊ូតុងខាងក្រោម។',
    ],
    'form' => [
        'title' => [
            'create' => 'បង្កើតអ្នកផ្គត់ផ្គង់',
            'update' => 'កែប្រែអ្នកផ្គត់ផ្គង់',
        ],
        'status' => [
            'label' => 'ស្ថានភាព',
            'active' => 'សកម្ម',
            'disable' => 'អសកម្ម',
        ],
        'button' => [
            'update' => 'កែប្រែ',
            'submit' => 'រក្សាទុក',
            'save_new' => 'រក្សាទុក & បង្កើតថ្មី',
            'cancel' => 'បោះបង់',
        ],
        'name' => [
            'label' => 'ឈ្មោះ',
            'placeholder' => 'បញ្ចូលឈ្មោះ...',
        ],
        'ordering' => [
            'label' => 'លំដាប់',
            'placeholder' => 'បញ្ចូលលំដាប់...',
        ],
    ],
    'validation' => [
        'name_required' => 'សូមបញ្ចូលឈ្មោះ',
        'name_max' => 'ឈ្មោះមិនត្រូវលើសពី ៥០ តួអក្សរទេ',
        'status_required' => 'សូមជ្រើសរើសស្ថានភាព',
        'status_max' => 'ស្ថានភាពមិនត្រូវលើសពី ១ តួអក្សរទេ',
        'status_numeric' => 'ទម្រង់ស្ថានភាពមិនត្រឹមត្រូវ',
    ],
    'dialog' => [
        'confirm_delete' => 'តើអ្នកប្រាកដជាចង់លុបអ្នកផ្គត់ផ្គង់នេះមែនទេ?',
        'confirm_action' => 'តើអ្នកប្រាកដជាចង់ :action មែនទេ?',
    ],
];
