<?php

return [
    'field' => [
        'no' => 'ល.រ',
        'name' => 'ឈ្មោះ',
        'email' => 'អ៊ីមែល',
        'phone' => 'លេខទូរស័ព្ទ',
        'role' => 'តួនាទី',
        'created_at' => 'កាលបរិច្ឆេទបង្កើត',
        'action' => 'សកម្មភាព',
        'status' => 'ស្ថានភាព',
    ],
    'paginate' => [
        'showing' => 'បង្ហាញ',
        'of' => 'នៃ',
        'rows_per_page' => 'ជួរក្នុងមួយទំព័រ:',
        'first' => 'ទំព័រដំបូង',
        'last' => 'ទំព័រចុងក្រោយ',
        'previous' => 'ទំព័រមុន',
        'next' => 'ទំព័របន្ទាប់',
    ],
];
