<?php

return [

    /*
    |--------------------------------------------------------------------------
    | product short view paginate
    |--------------------------------------------------------------------------
    */
    'sort' => [
        1 => '12',
        2 => '16',
        3 => '20',
        4 => '24',
        5 => '28',
        6 => '32',
        7 => '36',
        8 => '40',
        9 => '60',
    ],


    /*
    |--------------------------------------------------------------------------
    | section type
    |--------------------------------------------------------------------------
    */
    'types' => [
        1 => [
            'type' => 'job',
            'route' => 'job',
            'icon' => 'work',
            'name' => [
                'en' => 'Jobs',
                'km' => 'ការងារ',
            ],
            'description' => [
                'en' => 'Find the best jobs you interested in',
                'km' => 'ស្វែងរកការងារដែលអ្នកចាប់អារម្មណ៍',
            ],
        ],

        2 => [
            'type' => 'hotel',
            'route' => 'hotel',
            'icon' => 'bed',
            'name' => [
                'en' => 'Hotels',
                'km' => 'សណ្ឋាគារ',
            ],
            'description' => [
                'en' => 'Find the best hotels you like',
                'km' => 'ស្វែងរកសណ្ឋាគារដែលអ្នកចូលចិត្ត',
            ],
        ],

        3 => [
            'type' => 'real-estate',
            'route' => 'real-estate',
            'icon' => 'real_estate_agent',
            'name' => [
                'en' => 'Real Estates',
                'km' => 'អចលនទ្រព្យ',
            ],
            'description' => [
                'en' => 'Find the best real estates you like',
                'km' => 'ស្វែងរកអចលនទ្រព្យដែលអ្នកចូរចិត្ត',
            ],
        ],

        4 => [
            'type' => 'product',
            'route' => 'product',
            'icon' => 'production_quantity_limits',
            'name' => [
                'en' => 'General Products',
                'km' => 'ផលិតផលទូទៅ',
            ],
            'description' => [
                'en' => 'Buy the best products you like',
                'km' => 'ទិញផលិតផលដែលអ្នកចូរចិត្ត',
            ],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | hotel min price
    |--------------------------------------------------------------------------
    */
    'hotel-min-price' => [
        1 => '50',
        2 => '100',
        3 => '150',
        4 => '200',
        5 => '250',
    ],

    /*
    |--------------------------------------------------------------------------
    | hotel max price
    |--------------------------------------------------------------------------
    */
    'hotel-max-price' => [
        1 => '300',
        2 => '400',
        3 => '500',
        4 => '600',
        5 => '700',
    ],

    /*
    |--------------------------------------------------------------------------
    | real estate min price
    |--------------------------------------------------------------------------
    */
    'real-estate-min-price' => [
        1 => '100',
        2 => '500',
        3 => '1000',
        4 => '2000',
        5 => '4000',
    ],

    /*
    |--------------------------------------------------------------------------
    | real estate max price
    |--------------------------------------------------------------------------
    */
    'real-estate-max-price' => [
        1 => '5000',
        2 => '10000',
        3 => '15000',
        4 => '30000',
        5 => '50000',
    ],
];
